welcome_message = """Добро пожаловать в официальный Telegram-бот 32-й гимназии! 🏫

Здесь вы можете быстро и удобно получить доступ к самой актуальной информации. Наш бот поможет вам:

📚 <b>Узнать расписание</b>
Расписание уроков доступно по команде - /schedule

👩‍🏫 <b>Найти преподавателя</b>
Ознакомиться со списком наших учителей можно здесь - /teachers

🗣️ <b>Подготовиться к экзаменам</b>
• Узнать даты проведения устного собеседования для 9-х классов - /interview
• Посмотреть расписание ОГЭ - /oge
• Прорешать пробники на лучшем сайте ОГЭ и ЕГЭ - /probnick


Если у вас возникли вопросы, сложности или вы не нашли то, что искали, — не стесняйтесь обращаться! Наш менеджер всегда готов помочь. 👨‍💼

<b>Контакт менеджера:</b> @difuzick

Желаем продуктивного учебного года! ✨"""

teachers_message = """🏫 <b>Руководство школы</b>
<b>Директор</b> 👑
Гранкина Елена Дмитриевна

<b>Заместители директора по учебно-воспитательной работе (УВР)</b> 📚
Колмогорова Ирина Валерьевна
Воденникова Елена Владимировна

<b>Заместители директора по административно-хозяйственной части (АХЧ)</b> 🏠
Максимова Ирина Вячеславна
Сиротина Наталья Борисовна

👩‍🏫 <b>Педагогический состав по предметам</b>
<b>Русский язык и литература</b> 📖
Колмогорова Ирина Валерьевна, Чукомина Людмила Петровна, Толмачевская Ирина Борисовна, Оксак Марина Владимировна, Огаркова Алла Анатольевна, Лямина Елена Александровна, Кузикова Лилия Викторовна.

<b>Математика</b>➗
Моченова Альфия Шафиковна, Догадова Нина Александровна.

<b>Физика</b> ⚛️
Балакин Александр Кириллович, Шмарова Оксана Анатольевна.

<b>Химия</b> 🧪
Верховых Ирина Владимировна, Шмарова Оксана Анатольевна, Рыкова Анна Ивановна.

<b>Биология</b> 🌿
Верховых Ирина Владимировна, Широченкова Татьяна Петровна, Иванова Ирина Анатольевна.

<b>История и обществознание</b> 🏛️
Воденникова Елена Владимировна, Хренюхина Анастасия Сергеевна, Титевалова Ирина Николаевна, Неупокоева Татьяна Брониславовна.

<b>Физическая культура</b> ⚽
Котов Юрий Викторович, Андреев Сергей Ярославович, Суслова Наталья Павловна, Раков Андрей Юрьевич, Найданова Елена Александровна.

<b>География</b> 🌍
Широченкова Татьяна Петровна, Семенова Ольга Ивановна.

<b>Иностранные языки</b> 🗣️
Дмитриева Олеся Александровна, Севастьянова Виктория Николаевна, Балакина Людмила Андреевна, Понамарева Надежда Владимировна, Марфицына Ольга Александровна, Зыкова Татьяна Викторовна.

<b>Информатика и технология</b> 💻
Вяткина Надежда Владимировна, Азизова Асмар Суджаят кызы.

<b>Основы безопасности жизнедеятельности (ОБЖ)</b> 🚑
Раков Андрей Юрьевич.

<b>Музыка</b> 🎵
Гащенко Светлана Геннадьевна."""

oge_message = """<b>Основные дни проведения экзаменов:</b>
2 июня (вторник) — математика;
5 июня (пятница) — по всем учебным предметам (кроме русского языка и математики);
6 июня (суббота) — иностранные языки (английский, испанский, немецкий, французский), информатика;
9 июня (вторник) — русский язык;
16 июня (вторник) — по всем учебным предметам (кроме русского языка и математики);
19 июня (пятница) — по всем учебным предметам (кроме русского языка и математики).

<i>Резервные дни:</i>

29 июня (понедельник) — математика;
2 июля (четверг) — русский язык;
3 июля (пятница) — по всем учебным предметам (кроме русского языка
и математики);
6 июля (понедельник) — по всем учебным предметам (кроме русского языка
и математики);"""

interview_message = """<b>Основная дата проведения итогового собеседования</b> — 11 февраля 2026 года.

<i>Резервные даты</i> — 11 марта и 20 апреля 2025 года."""

schedule_message = """
Вот текущее расписание на ближайшие дни

Устаревшее расписание? - /update для обновления расписания!

Подписаться на рассылку расписаний?"""

help_text = """
Доступные команды:
/start - Перезапустить бота
/schedule - Посмотреть расписание
/update - Обновить расписание на случай если оно устаревшее
/teachers - Посмотреть список учителей
/probnick - Отправить сайт для подготовки к ОГЭ📚(fipi)
/oge - Расписание проведения экзаменов(ОГЭ)
/interview - Расписание проведения итогового собеседования
/materials - Показать справочные материалы
"""